{"Animal-suicide":{"slug":"Animal-suicide","filePath":"Animal suicide.md","title":"Animal suicide","links":["Concept-of-self","Animal-suicide---Wikipedia"],"tags":["psych","suicide"],"content":"Animal suicide\n\nWiki - Animal suicide\n\nKind of obvious, when an animal intentionally ends its own life through its actions.\n\nis debated among scientists, because it would imply animals to have the following:\n\nConcept of self\nConcept of death\nFuture intention\n\n\n\nExample: Do bees just instinctively protect their beehive or do they know of the sacrifice?\n\nis it just humans anthropomorphizing animals or is there actually something there?\n\n\nAnimal suicide\n\n\nRelated Concepts\n\n\n\nSource\n\nOriginal Source - Raindrop\n\n"},"Apex-predator":{"slug":"Apex-predator","filePath":"Apex predator.md","title":"Apex predator","links":["Top-predator","Superpredator","tags/why","tags/fun-todo","Thropic-cascade","Top-Predator","Thropic-level","Apex-predator---Wikipedia"],"tags":["animals","nature","why","fun-todo"],"content":"Apex predator\naka Top predator or superpredator\nSuperpredator\n\na predator on the top of a food chain, without any natural predators of its own.\nfood chains are often far shorter on land why fun-todo\ncan cause Thropic cascade\n\nfor example: reintroduction of gray wolves to Yellowstone National Part, causing a reduction of number of elk and in turn improved plant species\n\n\n\n\nApex predator\n\n\nRelated Concepts\n\nTop Predator\nSuperpredator\nThropic level fun-todo\nThropic cascade\n\nSource\n\nApex predator - Wikipedia\n"},"Beginning-of-Futures-Contracts":{"slug":"Beginning-of-Futures-Contracts","filePath":"Beginning of Futures Contracts.md","title":"Beginning of Futures Contracts","links":["Samurai","Chicago-Board-of-Trade","Futures-Contracts","Untitled-(4)"],"tags":["finance","history","futures"],"content":"Beginning of Futures Contracts\nThree origins:\n\nTo meet the needs of Samurai in Osaka who needed a conversion from rice to coin in case of bad harvest - Dojima Rice Exchange\nFirst standardized exchange traded forward contracts on grain - Chicago Board of Trade (1864)\nChicago Mercantile Exchange was the first exchange for futures and launched currency futures. (1972)\n\nAdded Interest Rate Futures (1976)\nAdded Stock Market Index Futures (1982)\n\n\n\n\nRelated Concepts\n\nChicago Board of Trade\nFutures Contracts\nUntitled (4)\n\nSource\nen.wikipedia.org/wiki/Futures_contract\n\nNotes:"},"Big-Five-Personality-Traits":{"slug":"Big-Five-Personality-Traits","filePath":"Big Five Personality Traits.md","title":"Big Five Personality Traits","links":["Extraversion","Changing-personality","Personalities-change-with-age"],"tags":[],"content":"Big Five Personality Traits\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTraitBFI-2NEO-PI-RBig Five AspectsNeuroticism / Negative Emotionality / Lack of Emotional StabilityAnxiety, Depression, Emotional VolatilityAnxiety, Depression, Hostility, Self‐consciousness, Impulsiveness, Vulnerability to StressWithdrawal, VolatilityExtraversionSociability, Assertiveness, Energy LevelWarmth, Gregariousness, Assertiveness, Activity, Excitement Seeking, Positive EmotionEnthusiasm, AssertivenessOpennessIntellectual Curiosity, Aesthetic Sensitivity, Creative ImaginationFantasy, Aesthetics, Feelings, Actions, Ideas, ValuesCreativity, IntellectAgreeablenessCompassion, Respectfulness, TrustTrust, Straightforwardness, Altruism, Compliance, Modesty, TendermindednessPoliteness, CompassionConscientiousnessOrder, Self‐Discipline, DutifulnessCompetence, Order, Dutifulness, Achievement Striving, Self‐Discipline, DeliberationOrderliness, Industriousness\n\nRelated Concepts\n\nExtraversion\nChanging personality\nPersonalities change with age\n\nSource\n\nCan you change your personality, really? - Consensus: AI Search Engine for Research\n"},"CAPM":{"slug":"CAPM","filePath":"CAPM.md","title":"CAPM","links":[],"tags":["finance","valuation"],"content":"CAPM\nCapital Asset Pricing Model\nCalculates the expected return of a financial asset based on the risk free rate, beta and market returns\nCAPM = R_{f} + \\beta\\ (R_{m} - R_{f})\n\nReferences"},"Changing-personality":{"slug":"Changing-personality","filePath":"Changing personality.md","title":"Changing personality","links":["Personalities-change-with-age","Mindfulness","Big-Five-Personality-Traits","Can-you-change-your-personality,-really---Consensus-AI-Search-Engine-for-Research"],"tags":[],"content":"Changing personality\n\nCan you really change your personality?\n\nSummary\n\nYes personalities change with age\nWith some protocols the big five traits can be changed\nNeuroticism is the most malleable of the traits, followed by extroversion\nTechniques\n\nTherapy - decreasing neuroticism, increasing extraversion\nMindfulness - decreasing neuroticism, increasing conscientiousness\nCoaching - decreasing neuroticism, increasing extraversion, increasing openness\n\nCoaching protocol for extraversion\n\n\nFaking it, until making it - can increase extroversion with right instructions\n\nFaking it plan for extraversion\n\n\nTraining - meh results\n\n\n\nKey Points\n\nYes, people really can change. And they do. Studies consistently find that there is a high degree of stability in people’s personality traits, which means that when groups of people’s traits are assessed and then reassessed some time apart, the results of the two tests are strongly correlated – but stability is not the same as immutability!\nNote:\n\n\nDespite the general stability in people’s personalities, studies also consistently find that personalities change with age. A meta-analysis of 92 longitudinal studies found that the Big Five personality traits change even well past the age of 30 (contradicting the common idea that personality is ‘set in stone’ by then).\nNote:\n\n\nNeuroticism appears to be the most malleable of the Big Five traits, followed by extraversion, but it is worth noting that these techniques for changing your personality are typically found to result in small or moderate changes (between 0.2 and 0.8 standard deviations, though some effects are larger).\nNote:\n\n\n1.Therapy\nNote:\n\n\nEffective for: Decreasing neuroticism, increasing extraversion\n\nIt might be obvious, but it’s true: therapy has been consistently shown to reduce neuroticism (i.e., improve emotional stability), and increase extraversion. The evidence for this is extremely strong – coming from a very large number of studies, including randomized controlled trials and meta-analyses.\nNote:\n\n1.Mindfulness\nNote:\n\n\nEffective for: Decreasing neuroticism, increasing conscientiousness\n\nThere is no universally used meaning of the word ‘mindfulness’, but scientific discussions often use some version of this famous definition: “[Mindfulness is] the awareness that emerges through paying attention on purpose, in the present moment, and nonjudgmentally to the unfolding of experience moment by moment.” So, it’s paying careful attention (without judgment) to things you’re experiencing.\nNote:\n\n\nCoaching\nNote:\n\n\n\nEffective for: Decreasing neuroticism, increasing extraversion, increasing openness\n\nLike therapy, coaching is a very broad category. And, also like therapy, within this broad category, there are a lot of very different practices. That’s why we’re going to get into the weeds a little bit here.\nNote:\n\nThis randomized controlled trial of 54 adults aged 18-64 (M =42.18, SD = 12.44) found that a 10-week course of individual coaching from trainee psychologists can produce reductions in neuroticism and increases in extraversion that remained present after 3 months. This coaching program involved the following components:\n\nCoaching protocol for extraversion\nResults: 10-week course can produce reductions in neuroticism and increases in extraversion\nClarify values and vision: The client’s personality is assessed and their values are explored. Together, client and coach explore how the client’s life is going and how their personality might be affecting that. Then a vision of an “ideal self” to aim for is developed.\nChoose targets for change: From that vision, the client and coach pick a few realistic personality subtraits (like self-discipline or anxiety) to focus on.\nBuild a tailored plan: Coach and client select strategies suited to those affecting those subtraits.\nFor example:\n\nIf self-discipline (a subtrait of conscientiousness) was chosen, the client would choose from strategies like goal setting, organizational skills, life style skills, positive self-talk.\nIf anxiety (a subtrait of neuroticism) was chosen, the client would choose from strategies like goal setting, positive self-talk, life style skills, cognitive therapy techniques, and exposure based techniques.\n\nClient and coach then develop an implementation plan together.\nPractice and adjust: Over 10 weeks, the client applies the techniques, with mid-program and end-program reassessments to track progress and refine strategies.\nMaintain gains: Clients finish with a plan for sustaining improvements, followed by a three-month check-in to see what stuck.\nNote:\n\n\nFaking It (Until You Make It)\nNote:\n\n\n\nEffective for: Decreasing neuroticism, increasing extraversion , increasing agreeableness, increasing conscientiousness\nNote:\n\n\nit. Well, the studies have tended to give participants prompts like this one (for extraversion):\n\nFaking it plan for extraversion\n“During the next week, we would like you to try to change your behavior. Specifically, for the next 7 days, try to act as talkative, assertive, and spontaneous as you can. Previous research has shown that performing these behaviors can be beneficial. Please list five specific ideas below for how and when you will incorporate these types of behaviors into your daily life.\nFor example, “When my friends are discussing something important to me, I will express my opinion.”\nThe evidence suggests that the way you formulate your ideas for how to fake the trait matters greatly. Vague goals like “be more talkative” produced no effects, whereas goals that were either ‘small steps’ (like “Invite Jenny and Thomas for dinner”) or conditional ‘implementation intentions’ (like IF I have an opinion on my team’s plan, THEN I will speak up and give my thoughts) were much more effective.\n\n\nTraining\nNote:\n\n\n\nEffective for: Increasing extraversion, increasing openness\n\nThere is evidence from a small number of individual studies (including randomized controlled trials and weaker studies) on specific demographics, that training programs that teach life skills might work to change personality traits. For instance:\nNote:\n\nSome small studies (such as this one, with no inactive control group) find “initial evidence” that training in things like assertiveness and flirting can boost extraversion.\nNote:\n\n\nLet’s jump into the findings:\n\nSee PDF for links to studies: Personality Traits And The Life Outcomes Associated With Them\nNote:\n\nWhat is personality?\nNote:\n\n\nRelated Concepts\n\nBig Five Personality Traits\nPersonalities change with age\n\nSource\n\nCan you change your personality, really - Consensus AI Search Engine for Research\nLink to original article\n"},"Convert-PPTX-to-PDF":{"slug":"Convert-PPTX-to-PDF","filePath":"Convert PPTX to PDF.md","title":"Convert PPTX to PDF","links":[],"tags":["pc_tips"],"content":"Convert PPTX to PDF\npython -m pip install pptxtopdf\nExample in script\nfrom pptxtopdf import convert\n \ninput_dir = r&quot;C:\\Users\\Example\\ExampleDirectory&quot;\noutput_dir = r&quot;C:\\Users\\Example\\ExampleDirectory&quot;\n \nconvert(input_dir, output_dir)\n\nRelated Concepts\nSource\npypi.org/project/pptxtopdf/"},"Dynamic-stochastic-general-equilibrium":{"slug":"Dynamic-stochastic-general-equilibrium","filePath":"Dynamic stochastic general equilibrium.md","title":"Dynamic stochastic general equilibrium","links":["Real-Business-Cycle-Models-(RBC)"],"tags":["DSGE","economics","macro","models"],"content":"Dynamic stochastic general equilibrium\nQuantitative econometric models of economic growth based on RBC (Real Business Cycle) models. They are dynamic, stochastic, general and refer to an equilibrium as the name suggests.\nOriginally presented by Kydland &amp; Presscot in 1982\n\nRelated Concepts\n\nReal Business Cycle Models (RBC)\n\nSource\nen.wikipedia.org/wiki/Dynamic_stochastic_general_equilibrium"},"ERP-is-much-higher-than-estimated":{"slug":"ERP-is-much-higher-than-estimated","filePath":"ERP is much higher than estimated.md","title":"ERP is much higher than estimated","links":[],"tags":["finance","psych","research"],"content":"ERP is much higher than estimated\nThe 5%-8% difference is an implausibly high difference between the returns of bonds and stocks. Mehra and Prescott (1985) show that the risk aversion should be 30 to derive 6% ERP, whereas the actual risk aversion should be approximately 1.\n\nRelated Concepts\nSource\nMehra and Prescott (1985)"},"Efficient-Market-Hypothesis":{"slug":"Efficient-Market-Hypothesis","filePath":"Efficient Market Hypothesis.md","title":"Efficient Market Hypothesis","links":[],"tags":["investing","finance"],"content":"Efficient Market Hypothesis\nThe efficient market hypothesis / efficient market theory is a hypothesis about share prices being reflective of all information and that their pricing is efficient. Thus generation of alpha is impossible consistently.\n\nReferences"},"Execution-of-Saddam-Hussein":{"slug":"Execution-of-Saddam-Hussein","filePath":"Execution of Saddam Hussein.md","title":"Execution of Saddam Hussein","links":[],"tags":["iraq","usa","dictator","execution"],"content":"Execution of Saddam Hussein\n\non 30 December 2006 at Camp Justice joint military base - convicted of crimes against humanity for killing 148 Shi’ites in retaliation for an attempt on his life\ncontroversy because of a mobile phone recording was leaked of the hanging, where he was being insulted by the observers\nhe requested death by firing squad - which was denied\nlast meal: chicken and rice with a cup of hot water with honey\n\n\nRelated Concepts\nSource\n\nExecution of Saddam Hussein\n"},"Extraversion":{"slug":"Extraversion","filePath":"Extraversion.md","title":"Extraversion","links":["Big-Five-Personality-Traits","Personalities-change-with-age"],"tags":[],"content":"Extroversion\n\ncan be split into following (see Source):\n\nSocial vitality: “corresponds more closely to traits like sociability, positive affect, gregariousness, and energy level”\nSocial dominance: “reflects such traits as dominance, independence, and self-confidence, especially in social contexts”\n\n\n\n\nRelated Concepts\n\nBig Five Personality Traits\n\nSource\n\nPersonalities change with age\n"},"Health-Disparities-with-Income":{"slug":"Health-Disparities-with-Income","filePath":"Health Disparities with Income.md","title":"Health Disparities with Income","links":["How-Health-Disparities-Develop-over-the-Lifecycle--NBER"],"tags":["income","finance","funfact","health","research-digest"],"content":"Health Disparities with Income\n\nHighlights:\n\n4.4 p.p. (67 %) higher five-year mortality for 70-year-old individuals with below-median income than those with above-median income\n35-year-old below-median = predicted mortality = 50-year-old above-median\n\n\n\n\n\n                  \n                  Quote \n                  \n                \n\nApproximately 60 percent of the divergence in the index across income groups is due to low-income individuals developing chronic illness at a faster rate, rather than chronically ill individuals earning lower incomes.\n\n\n\n\n                  \n                  Quote \n                  \n                \n\nAt younger ages, differences in the prevalence of psychological disorders contribute the most to the socioeconomic gap in the index, while diabetes and cardiovascular disease become increasingly important with age.\n\n\n\n\nRelated Concepts\n\n\n\nSource\n\nHow Health Disparities Develop over the Lifecycle  NBER\nHow Health Disparities Develop over the Lifecycle | NBER\n"},"IV-crush-crunch":{"slug":"IV-crush-crunch","filePath":"IV crush crunch.md","title":"IV crush crunch","links":["Post-Earnings-Announcement-Drift","ERP-is-much-higher-than-estimated"],"tags":["trading-ideas","investing"],"content":"IV crush / crunch\nIV gradually rises leading up to earnings (with traders anticipating big moves) and then drops significantly after the stock moves in either direction. Presents an opportunity if implied move is greater then historically implied move for short volatility and inverse with at the money straddles. Should start following a week or two before earnings.\n\nRelated Concepts\n\nPost-Earnings Announcement Drift\nERP is much higher than estimated\n\nSource\n\nwww.canva.com/design/DAGjAYGhhrI/9Obl9YEh_bxMZntcLTn26Q/view#7\nwiki.earnings-watcher.com/\n"},"Keynesian-beauty-contest":{"slug":"Keynesian-beauty-contest","filePath":"Keynesian beauty contest.md","title":"Keynesian beauty contest","links":["John-Maynard-Keynes","General-Theory-of-Employment,-Interest-and-Money","Wisdom-of-the-crowd","Surprisingly-popular"],"tags":["economics","stock-market","beh_finance"],"content":"Keynesian beauty contest\nA beauty contest, in which you are meant to select your percieved most popular pick among other judges, not the actual best contestant.\nThis theory stipulates that an investor could profit more by buying the stocks that are favoured by the general public, not necessarily their best percieved stock, based on fundamentals or theory.\nDeveloped by John Maynard Keynes, and developed in the Chapter 12 of his seminal work The General Theory of Employment, Interest and Money (1936) to explain price fluctuations in equity markets.\nSee also\n\nJohn Maynard Keynes\nGeneral Theory of Employment, Interest and Money\nWisdom of the crowd\nSurprisingly popular\n\nSource\n\nen.wikipedia.org/wiki/Keynesian_beauty_contest\n"},"Killing-of-Osama-bin-Laden":{"slug":"Killing-of-Osama-bin-Laden","filePath":"Killing of Osama bin Laden.md","title":"Killing of Osama bin Laden","links":[],"tags":["terrorism","usa","cia"],"content":"Killing of Osama bin Laden\nMay 2nd, 2011 - Pakistan\n\n\nshortly before 1:00 AM\n\n\nidentified the compound by tracking curriers\n\n\nOsama bin Laden was 1.93 m tall?\n\n\nOperation Neptune Spear\n\n\n90% of US public was in favour of operation, 2/3 of Pakistani public was against\n\n\n1:1 replica of the compound built for training\n\n\n79 commandos and a dog (Belgian Malinois named Cairo)\n\n\none helicopter ruined because of the walls\n\n\nGeronimo EKIA (enemy killed in action)\n\n\nObama said: “We got him”\n\n\nOsama bin Laden was buried at sea because no country would accept his remains\n\n\n\nRelated Concepts\nSource\n\nKilling of Osama bin Laden\n"},"Mindfulness":{"slug":"Mindfulness","filePath":"Mindfulness.md","title":"Mindfulness","links":["Big-Five-Personality-Traits","Imports/Raindrops/Health/Can-you-change-your-personality,-really---Consensus-AI-Search-Engine-for-Research"],"tags":[],"content":"Mindfulness\n\nRelated Concepts\n\nBig Five Personality Traits\n\n\nSource\n\nRaindrop Link\n\n"},"NYSE":{"slug":"NYSE","filePath":"NYSE.md","title":"NYSE","links":[],"tags":["finance","history"],"content":"NYSE\nThe New York Stock Exchange, or the Exchange, was founded in 1792 and officially named “The New York Stock Exchange” on March 8, 1817; the first listed company was the Bank of New York.\n\nRelated Concepts\nSource"},"Neoclassical-Growth-Model":{"slug":"Neoclassical-Growth-Model","filePath":"Neoclassical Growth Model.md","title":"Neoclassical Growth Model","links":[],"tags":[],"content":"Neoclassical Growth Model\naka Ramsey–Cass–Koopmans model, or Ramsey growth model\nThe Neoclassical Growth Model, developed by Robert Solow and Trevor Swan in the 1950s, is a fundamental economic model that explains long-run economic growth through capital accumulation, labor growth, and technological progress. It builds on the Solow-Swan model and serves as the foundation for modern growth theory.\nImplications:\n\n\nConditional Convergence: Poorer economies with lower capital per worker grow faster than richer ones, assuming they have similar savings rates, population growth, and access to technology.\n\n\nRole of Technology: Since capital accumulation alone leads to diminishing returns, long-term growth is driven by technological progress (A).\n\n\nPolicy Insights: Policies that encourage savings and investment can increase the steady-state level of output but do not affect long-run growth rates, which depend on exogenous technological progress.\n\n\n\nRelated Concepts\nSource"},"On-the-Origin-of-Species":{"slug":"On-the-Origin-of-Species","filePath":"On the Origin of Species.md","title":"On the Origin of Species","links":["Charles-Darwin","tags/dates","Beagle-expedition","tags/fun-todo"],"tags":["biology","darwin","evolution","humans","history","famous-people","dates","fun-todo"],"content":"On the Origin of Species\nby Charles Darwin\nPublished: Nov 1859 dates\n\nevidence collected on the Beagle expedition in the 1930s\nwritten for non-specialist readers\nDarwin was highly regarded as scientist\n\n why?? fun-todo\n\n\nbegan work in 1837, published 22 years later\n\npursued it for 15 years (from 1844)\n\n\n\n\n“It is interesting to contemplate an entangled bank, clothed with many plants of many kinds, with birds singing on the bushes, with various insects flitting about, and with worms crawling through the damp earth, and to reflect that these elaborately constructed forms, so different from each other, and dependent on each other in so complex a manner, have all been produced by laws acting around us … Thus, from the war of nature, from famine and death, the most exalted object which we are capable of conceiving, namely, the production of the higher animals, directly follows. There is grandeur in this view of life, with its several powers, having been originally breathed into a few forms or into one; and that, whilst this planet has gone cycling on according to the fixed law of gravity, from so simple a beginning endless forms most beautiful and most wonderful have been, and are being, evolved.” - Charles Darwin\n\n\nRelated Concepts\n\nCharles Darwin\nBeagle expedition\n\nSource\n\nOn the Origin of Species\n"},"Personalities-change-with-age":{"slug":"Personalities-change-with-age","filePath":"Personalities change with age.md","title":"Personalities change with age","links":["Extraversion","Big-Five-Personality-Traits","Changing-personality"],"tags":[],"content":"Personalities change with age\n\nfrom study in source\nextroversion\n\nExtraversion split into two different subtraits\n- Social vitality: “corresponds more closely to traits like sociability, positive affect, gregariousness, and energy level”\n- Social dominance: “reflects such traits as dominance, independence, and self-confidence, especially in social contexts”\n\n\nRelated Concepts\n\nBig Five Personality Traits\n\nSource\n\nChanging personality\nStudy - Patterns of mean-level change in personality traits across the life course: A meta-analysis of longitudinal studies.\n"},"Post-Earnings-Announcement-Drift":{"slug":"Post-Earnings-Announcement-Drift","filePath":"Post-Earnings Announcement Drift.md","title":"Post-Earnings Announcement Drift","links":["ERP-is-much-higher-than-estimated","Efficient-Market-Hypothesis"],"tags":["finance","anomalies","investing","quant","stock-market","trading-ideas"],"content":"Post-Earnings Announcement Drift\nTendency for the stock price to keep moving in the direction of the earning’s surprise for several weeks/months after announcement.\n\nRelated Concepts\nERP is much higher than estimated\nEfficient Market Hypothesis\nSource\nen.wikipedia.org/wiki/Post%E2%80%93earnings-announcement_drift\nquantpedia.com/strategies/post-earnings-announcement-effect"},"Pred-India-could-be-market-leader":{"slug":"Pred-India-could-be-market-leader","filePath":"Pred India could be market leader.md","title":"Pred India could be market leader","links":["Neoclassical-Growth-Model"],"tags":["asia","investing","i-play"],"content":"Pred: India could be market leader\nBased on this Goldman Sachs IG post:\n\nIndia investments could be the move\n\nRelated Concepts\nNeoclassical Growth Model\nSource\nwww.instagram.com/p/DHWjO0rP4md/"},"Robert-Solow":{"slug":"Robert-Solow","filePath":"Robert Solow.md","title":"Robert Solow","links":["Zettlekasten/Paul-Samelson","Neoclassical-Growth-Model","Untitled-(3)"],"tags":["famous-people","macro","economics","harvard","nobel"],"content":"Robert Solow\nKey facts\nFull name: Robert M. Solow\nBorn: 23 August 1924 - Brooklyn, NY\nDied: /\nNationality: American\nFamous for: Exogenous growth model\nAlma mater: Harvard university\nNobel prize laureate\nBio\n\nFormed the MIT Econ department with Paul Samelson\nSolow and Samuelson created the von Neumann growth theory (1953), capital theory (1956), linear programming and Phillips Curve (1960)\nCreated the Neoclassical Growth Model (1956, 1970) a.k.a the Untitled (3)\nLaunched the Cambridge Capital Controversy (Solow and Samuelson against Joan Robinson and other Keynesians)\n\n\n\nReferences"},"Samurai":{"slug":"Samurai","filePath":"Samurai.md","title":"Samurai","links":[],"tags":[],"content":"Samurai\nMembers of the Warrior class in Japan - 12th century to 1870s\n\nRelated Concepts\nSource"},"Setup-Guide":{"slug":"Setup-Guide","filePath":"Setup Guide.md","title":"Setup Guide","links":[],"tags":["guides"],"content":"Setup Guide\nA GitHub account is required to use Quartz and Quartz Syncer.\nSet up Quartz first\nQuartz Syncer manages Quartz content from Obsidian. Make sure you have Quartz configured before enabling the plugin.\n1. Create the Quartz repository\nIf you have not already, create a new repository based on the official Quartz template:\ngithub.com/jackyzha0/quartz/generate\n\nName the repository after the site you want to publish. If you want the site to live at smrik.github.io, create the repository smrik/smrik.github.io. If you prefer a project page (for example smrik.github.io/quartz), name the repository smrik/quartz.\n2. Configure Quartz\nOpen quartz.config.ts and update the core settings. The example below shows only the relevant portion—do not remove other settings.\nconst config: QuartzConfig = {\n  configuration: {\n    pageTitle: &quot;Quartz 4&quot;,\n    baseUrl: &quot;smrik.github.io&quot;,\n    defaultDateType: &quot;modified&quot;,\n    // … keep remaining options unchanged\n  },\n  plugins: {\n    transformers: [\n      Plugin.CrawlLinks({ markdownLinkResolution: &quot;shortest&quot; }),\n      // … keep remaining plugins unchanged\n    ],\n  },\n}\n\npageTitle: Controls the browser tab title.\nbaseUrl: Use smrik.github.io for a user site, or smrik.github.io/repository-name for a project site.\ndefaultDateType: Set to created, modified, or published depending on which date you want displayed on notes.\nmarkdownLinkResolution: Match this to the way Obsidian resolves links (shortest, relative, or absolute).\n\n3. Configure automatic deployment\nEnable GitHub Pages for the repository: Settings → Pages → Source → GitHub Actions.\nAdd .github/workflows/deploy.yaml with one of the templates below.\nOption 1: Default Quartz\nname: Deploy Quartz site to GitHub Pages\n \non:\n  push:\n    branches:\n      - v4\n \npermissions:\n  contents: read\n  pages: write\n  id-token: write\n \nconcurrency:\n  group: &quot;pages&quot;\n  cancel-in-progress: false\n \njobs:\n  build:\n    runs-on: ubuntu-22.04\n    steps:\n      - uses: actions/checkout@v4\n        with:\n          fetch-depth: 0\n      - uses: actions/setup-node@v4\n        with:\n          node-version: 22\n      - run: npm ci\n      - run: npx quartz build\n      - uses: actions/upload-pages-artifact@v3\n        with:\n          path: public\n \n  deploy:\n    needs: build\n    environment:\n      name: github-pages\n      url: ${{ steps.deployment.outputs.page_url }}\n    runs-on: ubuntu-latest\n    steps:\n      - name: Deploy to GitHub Pages\n        id: deployment\n        uses: actions/deploy-pages@v4\nOption 2: Quartz with Quartz Themes\nUse this if you want to pull an Obsidian theme during the build. Replace THEME_NAME with the desired theme.\nname: Deploy Quartz site to GitHub Pages\n \non:\n  push:\n    branches:\n      - v4\n \nenv:\n  THEME_NAME: tokyo-night\n \npermissions:\n  contents: read\n  pages: write\n  id-token: write\n \nconcurrency:\n  group: &quot;pages&quot;\n  cancel-in-progress: false\n \njobs:\n  build:\n    runs-on: ubuntu-22.04\n    steps:\n      - uses: actions/checkout@v4\n        with:\n          fetch-depth: 0\n      - uses: actions/setup-node@v4\n        with:\n          node-version: 22\n      - run: npm ci\n      - run: curl -s -S raw.githubusercontent.com/saberzero1/quartz-themes/master/action.sh | bash -s -- $THEME_NAME\n      - run: npx quartz build\n      - uses: actions/upload-pages-artifact@v3\n        with:\n          path: public\n \n  deploy:\n    needs: build\n    environment:\n      name: github-pages\n      url: ${{ steps.deployment.outputs.page_url }}\n    runs-on: ubuntu-latest\n    steps:\n      - name: Deploy to GitHub Pages\n        id: deployment\n        uses: actions/deploy-pages@v4\nRun npx quartz build locally to confirm the markdown in your vault generates HTML in public/. If notes do not render, check that each file has front matter (see troubleshooting below).\nGenerate a fine-grained access token\n\nGo to github.com/settings/tokens\nSet Token name to something descriptive, e.g. Quartz Syncer token.\nChoose an Expiration date (GitHub emails you before it expires).\nUnder Repository access, select Only select repositories and pick your Quartz repository.\nIn Repository permissions → Contents, change Access from No access to Read and write.\nClick Generate token, confirm the settings, and copy the token.\n\nSet up Quartz Syncer\n\nOpen Obsidian → Settings → Community Plugins → Quartz Syncer → Options.\nFill in the fields:\n\nGitHub repo name: e.g. smrik.github.io or quartz.\nGitHub username: smrik.\nGitHub token: paste the fine-grained token (starts with github_pat_ or ghp_).\n\n\nYou should see a green check mark once connection succeeds. If not, review the troubleshooting docs.\n\nTroubleshooting: Markdown not converting to HTML\n\n\nEnsure each note has YAML front matter:\n---\ntitle: My Note\ndraft: false\n---\nNotes without front matter may be skipped.\n\n\nVerify the note lives inside the content directory Quartz reads from. In this setup, content is a symlink to Patrik&#039;s Vault/Zettelkasten.\n\n\nRun npx quartz build --verbose to check for parser warnings. Fix any reported issues, then redeploy.\n\n\nAll set\nOnce the workflow succeeds, your site publishes automatically at smrik.github.io. Trigger a deployment by pushing to the v4 branch (or the branch you configured) or by running Quartz Syncer from Obsidian.\nFor additional options, refer to the Quartz documentation: quartz.jzhao.xyz."},"Superpredator":{"slug":"Superpredator","filePath":"Superpredator.md","title":"Superpredator","links":["Apex-predator","Top-predator"],"tags":[],"content":"Superpredator\nduplicate of Apex predator\n\nRelated Concepts\n\nTop predator\n\nSource\n\nApex predator\n"},"Surprisingly-popular":{"slug":"Surprisingly-popular","filePath":"Surprisingly popular.md","title":"Surprisingly popular","links":["Wisdom-of-the-crowd","Keynesian-beauty-contest"],"tags":["beh_finance","anomalies"],"content":"Surprisingly popular\nA wisdom of the crowd technique that uses the expert minority opinion of the crowd by asking:\n\nWhat is the probability that this answer is correct (your percieved knowledge)\nWhat is the probability that others will give to this answer (your percieved knowledge of others - how more qualified you are)\n\nThe non-expert group will give similar estimates, therefore cancelling themselves out.\nSee Also\n\nWisdom of the crowd\nKeynesian beauty contest\n\nSource\n\nSurprisingly popular\n"},"Ted-Kaczynski":{"slug":"Ted-Kaczynski","filePath":"Ted Kaczynski.md","title":"Ted Kaczynski","links":[],"tags":["crime","famous-people","history"],"content":"Ted Kaczynski\naka. Unabomber\n\nTed Kaczynski: Theodore John Kaczynski ( May 22, 1942 – June 10, 2023),\nalso known as the Unabomber ( YOO-nə-bom-ər), was an American mathematician and domestic terrorist. A mathematics prodigy, he abandoned his academic career in 1969 to pursue a reclusive primitive lifestyle and lone wolf terrorism campaign.\nKaczynski murdered 3 people and injured 23 others between 1978 and 1995 in a nationwide mail bombing campaign against people he believed to be advancing modern technology and the destruction of the natural environment.\nHe authored a roughly 35,000-word manifesto and social critique called Industrial Society and Its Future (1995) which opposes all forms of technology, rejects leftism and fascism, advocates cultural primitivism, and ultimately suggests violent revolution.\nHanged himself in prison in 2023.\n\nRelated Concepts\nSource\nTed Kaczynski\nUnabomber — FBI"},"The-EU-will-emerge-stronger":{"slug":"The-EU-will-emerge-stronger","filePath":"The EU will emerge stronger.md","title":"The EU will emerge stronger","links":[],"tags":["prediction","EU","Trump","stock-market","investing","politics"],"content":"The EU will emerge stronger\nBecause of Trump’s volatile statements, the EU will have to decide to protect themselves by pushing for defence spending and more federalisation.\nPositive signals right now:\n\nUnited front against Trump\nGood relations with UK (UK stepping in to help Ukraine)\nMertz plan for German defence spending (big investment, looser deficit rules)\nLe Pen banned from elections\nSlowing of right-wing, anti-EU parties\n\n\nRelated Concepts\nSource\n\nmy brain\n"},"Theory-and-Practice-Quote":{"slug":"Theory-and-Practice-Quote","filePath":"Theory and Practice Quote.md","title":"Theory and Practice Quote","links":[],"tags":["quote"],"content":"Theory and Practice Quote\nOne of my favorite quotes is attributed to Albert Einstein and Yogi Berra, among others: “In theory, there is no difference between theory and practice. In practice, there is.”\n\nReferences"},"Three-Point-Field-Goal":{"slug":"Three-Point-Field-Goal","filePath":"Three Point Field Goal.md","title":"Three Point Field Goal","links":[],"tags":["basketball","sports"],"content":"Three Point Field Goal\nAdded in 1979 to NBA, first scored by Chris Ford of the Boston Celtics\nDistance (NBA): 23 feet 9 inches (7.24 m)\nDistance (FIBA): 6.75 m (22 ft 1.75 in)\n\nRelated Concepts\nSource\nen.wikipedia.org/wiki/Three-point_field_goal"},"Top-predator":{"slug":"Top-predator","filePath":"Top predator.md","title":"Top predator","links":["Superpredator","Apex-predator"],"tags":[],"content":"Top predator\nduplicate of apex predator\n\nRelated Concepts\n\nSuperpredator\n\nSource\n\nApex predator\n"},"Trevor-Swan":{"slug":"Trevor-Swan","filePath":"Trevor Swan.md","title":"Trevor Swan","links":["Robert-Solow","Untitled-(3)"],"tags":["famous-person","macro","Solow-Swan","economist"],"content":"Trevor Swan\nKey facts\nFull name: Trevor Winchester Swan\nBorn: 14 January 1918\nDied: 15 January 1989\nNationality: Australian\nFamous for: Solow-Swan model\nAlma mater: University of Sydney\nOne of the finest economists not to recieve a Nobel Memorial Prize. The greatest Australian economist.\nWorks\nNeoclassical growth model (1956) - simultaneosly and nearly identical to that of Robert Solow also called the Untitled (3)\n\nReferences"},"We-will-be-like-cats-to-AI":{"slug":"We-will-be-like-cats-to-AI","filePath":"We will be like cats to AI.md","title":"We will be like cats to AI","links":["Can-AI-have-emotions"],"tags":["ai","prediction","ai-future"],"content":"We will be like cats to AI\nGranted it sounds stupid and out there, but with some people claiming that AI will want to get rid of us when it becomes vastly smarter then us - I just have to disagree.\nWe have a cat that effectively does nothing around the house, just lays there, eats food and even hisses at use sometimes. It costs money to feed and time to clean after her. So why do we have it? Well because it makes us feel nice, we are giving a home to a nice animal and we pet it and laugh. In her mind, she does things - she guards the house, patrols around on set times in mornings and evenings, marks her territory etc. But to us that seems just like a cute meaningless thing cats do.\nWe are vastly more intelligent than the cat, but do we want to get rid of her? No.\nSo if AI becomes vastly smarter than us, why would it want to get rid of us? Well here I have two views:\n\nIt will get rid of us: the reason we keep animals is because they make us feel joy, which is largely a human emotion and AI won’t (well i don’t know - Can AI have emotions?) have the emotions, so it will get no benefit from taking care of us.\nIt won’t get rid of us: the other scenario is that we will become in turn like AI’s pets. They will do the actual work and provide for us, give us money etc. Maybe they will even let us go to work (like a sham job that feels meaningful to us - like a cat pissing to mark territory - huge for her, bullshit for us) and feel like it means something. But it won’t.\n\nis that bad: well no, when I look at my cat I’m jealous that she gets to not have any worry in life and just lives in bliss\n\n\n\n\nRelated Concepts\n\nCan AI have emotions?\n\nSource\n\n\n\n"},"You-need-to-be-obsessed-psychotic-to-succeed":{"slug":"You-need-to-be-obsessed-psychotic-to-succeed","filePath":"You need to be obsessed psychotic to succeed.md","title":"You need to be obsessed psychotic to succeed","links":[],"tags":["psych","basketball"],"content":"You need to be obsessed / psychotic to succeed\nYou need the mentality of narcissism and irrational belief in oneself to succeed in life. Saying I’m smarter and I’m better than everyone and anyone else in the world. Still need to analyse future developments in this scene. TODO - possibly CBT, analyse visulisation\n\nRelated Concepts\nSource"},"Zettel-Quick/Database-of-Literature":{"slug":"Zettel-Quick/Database-of-Literature","filePath":"Zettel Quick/Database of Literature.md","title":"Database of Literature","links":[],"tags":[],"content":"TABLE  \ntitle as Title,  \nFirstAuthor as &quot;First Author&quot;,  \nYear as Year,  \nitemType as Item,  \nCitekey as Citekey,  \nContribution as Contribution  \nFROM &quot;Literature Notes&quot;  "},"Zettel-Quick/Todo":{"slug":"Zettel-Quick/Todo","filePath":"Zettel Quick/Todo.md","title":"Todo","links":[],"tags":[],"content":"\n\nen.wikipedia.org/wiki/Yield_curve\n\n\nHow does positive visualtisation help / hurt you\n\n\nHow to change your mentality to become obsessive\n\n\nlong term play: bet on luxury, inequality getting bigger and bigger\n\n\nextra thought: the main reason for market inefficiency and limits to the invisible hand of economy is asymmetrical information - in a perfectly efficient and transparent system - this would not happen\n\n\nwe are always inherently selfish in nature, but some selfishness is more longterm and some is more short term because of societal standards and stigmas\n\n\nam i really interested in human behaviour? is this my jam? - what branch is this?\n\n\nmaybe i should treat everything in life as DCF? - add another prize to avoid reels\n\n\nfor mag:\n\nintroduction: recently earnings by Nvidia showing the entire world is listening to earnings, but is the market actually “listening” or just reading.\nalso how we can price stocks with options???\n\n\n"},"Zettel-Quick/Untitled":{"slug":"Zettel-Quick/Untitled","filePath":"Zettel Quick/Untitled.md","title":"Untitled","links":[],"tags":[],"content":"\n\n LINC application\n\n\n Pay for novisch\n\n\n Bolj točen workout plan\n\n\n CFA šla\n\n\n KPMG naredi sidebar\n\n\n BCG - še dva dni\n\n\n Preglej za magistrsko delo\n\n\n Preberi članke za BUSO\n\n[ ]\n\n\n"},"index":{"slug":"index","filePath":"index.md","title":"Home","links":["tags/","Zettel-Quick/Todo"],"tags":[],"content":"👋 Welcome\nThis is my public Zettelkasten — a collection of notes, ideas, and references that I am comfortable sharing online.\n\nUse the search in the top right to jump to any topic.\nBrowse by tag to find related ideas.\nDip into my quick notes to see what I’m currently sketching out.\n\nHave fun exploring, and feel free to reach out if something sparks a thought."},"testing-the-site...":{"slug":"testing-the-site...","filePath":"testing the site....md","title":"testing the site...","links":[],"tags":[],"content":"testing the site"}}